# PathName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSavingAsEventArgs..::..PathName Property
DocumentSavingAsEventArgs Class See Also
---
Target path to which the document is to be saved.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public string PathName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathName As String
	Get
```

Visual C++
---
```text
public:
property String^ PathName {
	String^ get ();
}
```

# See Also
DocumentSavingAsEventArgs Class
Autodesk.Revit.DB.Events Namespace